## Assignment 5 (is worth 15 points and is due Tuesday 12/3 by 11:59pm).

In [23]:
#Q1: Import numpy and pandas (0.25 p).
import numpy as np
import pandas as pd

In [25]:
#Q2: Read in 'payroll.csv' and store it in a df (0.25 p).
myfile = "C:/Users/msabo/iCloudDrive/Desktop/Binghamton/7. Fall 2024/MIS-525/payroll.csv"
df = pd.read_csv(myfile)

In [27]:
#Q3: Check the head of the df (0.25 p).
df.head()

,ID,Name,Title,Wage,Bonus,Benefits,Year,State
0,68595,James A Mullan,Deputy Sheriff,5260.50,14604.82,1883.52,2019,AZ
1,21249,ANTHONY RIVERA,"LIEUTENANT, FIRE DEPARTMENT",123105.02,14801.03,NaN,2017,FL
2,77733,Monique J Johnson,Deputy Sheriff,91370.03,2415.19,31364.48,2019,IL
3,94889,Peter G Silva,Park Patrol Officer,61036.02,778.20,27370.90,2020,PA
4,70725,DAVID SANDS,POLICE OFFICER II,105346.24,11923.74,NaN,2017,WV

In [29]:
#Q4: Check the number of rows and columns (0.25 p).
df.shape

(148550, 8)

In [31]:
#Q5: Sort the df by 'ID' and confirm the result of the previous question (0.25 p).
df.sort_values("ID")

,ID,Name,Title,Wage,Bonus,Benefits,Year,State
85318,1,Bunyan Johnson,Sr District Atty Investigator,104965.01,6298.69,36969.38,2018,OR
135997,2,Gary Ouyang,Sales Clerk,68291.00,7790.06,41596.95,2018,CT
133622,3,MANOHAR RAJU,ATTORNEY (CIVIL/CRIMINAL),146726.01,0.00,NaN,2017,WI
92852,4,Sandra E Marin,Senior Clerk,63577.47,1280.00,26418.28,2019,LA
130349,5,Kevin Smith,Sales Clerk,718.22,3.59,243.48,2018,NJ
...,...,...,...,...,...,...,...,...
142306,148546,Maria D Green,Recreation Leader,13263.75,8.10,132.72,2019,TX
67932,148547,Renato Gutierrez,Sales Clerk,65174.41,1736.67,34215.82,2020,AR
130871,148548,Mohammed Saifullah,IS Programmer Analyst-Senior,6374.80,0.00,2382.62,2020,GA
12216,148549,Mark H Keville,Carpenter,62517.44,0.00,22238.61,2019,MD
109245,148550,TONYA THOMPSON,PRINCIPAL CLERK,63538.43,867.79,NaN,2017,NY

In [33]:
#Q6: Check the data type of each column (0.25 p).
df.dtypes

ID            int64
Name         object
Title        object
Wage        float64
Bonus       float64
Benefits    float64
Year          int64
State        object
dtype: object

In [35]:
#Q7: Create a new column 'TotalPay' which will be the sum of wage, bonus, and benefits (0.5 p).
df["TotalPay"] = df["Wage"] + df["Bonus"] + df["Benefits"]

In [37]:
#Q8: Check the updated df (0.25 p).
df

,ID,Name,Title,Wage,Bonus,Benefits,Year,State,TotalPay
0,68595,James A Mullan,Deputy Sheriff,5260.50,14604.82,1883.52,2019,AZ,21748.84
1,21249,ANTHONY RIVERA,"LIEUTENANT, FIRE DEPARTMENT",123105.02,14801.03,NaN,2017,FL,NaN
2,77733,Monique J Johnson,Deputy Sheriff,91370.03,2415.19,31364.48,2019,IL,125149.70
3,94889,Peter G Silva,Park Patrol Officer,61036.02,778.20,27370.90,2020,PA,89185.12
4,70725,DAVID SANDS,POLICE OFFICER II,105346.24,11923.74,NaN,2017,WV,NaN
...,...,...,...,...,...,...,...,...,...
148545,84175,Sonji Walker,"Counselor, Family Court Svc",98790.07,5515.46,40564.44,2018,MT,144869.97
148546,37801,Louise M Rainey,"Sctry, Human Svcs. Commission",37703.20,0.00,377.04,2020,GA,38080.24
148547,6006,GEORGE COUVSON,SENIOR TRANSIT TRAFFIC CHECKER,66289.24,3539.71,NaN,2017,DE,NaN
148548,56920,DEMASTER SURVINE,Sales Clerk,66288.35,4176.06,NaN,2017,NY,NaN
148549,48242,Quincy Stamper,Recreation Leader,13749.82,183.47,1197.74,2018,AK,15131.03

In [39]:
#Q9: Find out the lowest amount of 'TotalPay' in the dataset (0.25 p).
min_pay = df["TotalPay"].min()
min_pay

-159.45

In [43]:
#Q10: Find out the highest amount of 'TotalPay' in the dataset (0.25 p).
max_pay = df["TotalPay"].max()
max_pay

510732.68

In [45]:
#Q11: Calculate the average 'TotalPay' in the dataset (0.25 p).
avg_pay = df["TotalPay"].mean()
avg_pay

95940.39992262077

In [47]:
#Q12: Find out how many employees make more money in total than the average (0.5 p).
above_avg_count = 0
for i in df["TotalPay"]:
    if i > avg_pay:
        above_avg_count += 1

above_avg_count

58742

In [51]:
#Q13: Find out the id, title, and state of 'Michael J Proctor' (0.5 p).
mjp = df[["ID", "Title", "State"]][df["Name"] == "Michael J Proctor"]
mjp

           ID        Title State
50554  115516  Electrician    NY

In [55]:
#Q14: Find out how much 'Michael J Proctor' makes in total (0.5 p).
mjp_pay = df["TotalPay"][df["Name"] == "Michael J Proctor"]
mjp_pay

50554    38348.15
Name: TotalPay, dtype: float64

In [73]:
#Q15: Find out the record of the person with the highest 'Wage' (0.5 p).
df.loc[[df["Wage"].idxmax()]]

,ID,Name,Title,Wage,Bonus,Benefits,Year,State,TotalPay
98226,86072,Gregory P Suhr,Chief of Police,319275.01,20007.06,86533.21,2019,FL,425815.28

In [87]:
#Q16: Find out the number of employees (IDs) per year (0.5 p).
df[["Year", "ID"]].groupby("Year").count()

         ID
Year
2017  36144
2018  36748
2019  37585
2020  38073

In [89]:
#Q17: Find out the number of employees (IDs) in NY per year (0.5 p).
df[df["State"] == "NY"][["Year", "ID"]].groupby("Year").count()

        ID
Year
2017  2124
2018  2363
2019  2351
2020  2449

In [109]:
#Q18: Find out the average 'TotalPay' of all employees per year (0.5 p).
df[["Year", "TotalPay"]].groupby("Year").mean()

          TotalPay
Year
2017  93612.806370
2018  95527.975619
2019  97562.000144
2020  94928.488456

In [97]:
#Q19: Find out the average 'TotalPay' of employees who work either in NY or NJ per year (0.5 p).
df[(df["State"] == "NY") | (df["State"] == "NJ")].groupby("Year")[["TotalPay"]].mean()

          TotalPay
Year
2017  91147.641182
2018  95904.967616
2019  97806.752646
2020  95400.235250

In [111]:
#Q20: Count the number of missing values in each column (0.5 p).
df.isnull().sum()

ID              0
Name            0
Title           0
Wage          605
Bonus           0
Benefits    33444
Year            0
State           0
TotalPay    34049
dtype: int64

In [113]:
#Q21: Fill the missing values in 'Wage' with its average (0.5 p).
df["Wage"].fillna(df["Wage"].mean())

0           5260.50
1         123105.02
2          91370.03
3          61036.02
4         105346.24
            ...
148545     98790.07
148546     37703.20
148547     66289.24
148548     66288.35
148549     13749.82
Name: Wage, Length: 148550, dtype: float64

In [127]:
#Q22: Find out the employee with the highest 'Wage' in each year (2 p).
max_wage = df.groupby("Year")["Wage"].idxmax()
df.loc[max_wage, ["Year", "Name", "Wage"]].set_index("Year")

                   Name       Wage
Year
2017  EDWARD HARRINGTON  294580.02
2018       Gregory Suhr  302578.00
2019     Gregory P Suhr  319275.01
2020         Amy P Hart  318835.49

In [153]:
#Q23: Find out the top three most common job titles (0.75 p).
df.groupby("Title")["Title"].count().sort_values(ascending = False).head(3)

Title
Sales Clerk               9421
Public Officer            8308
Administrative Support    4952
Name: Title, dtype: int64

In [157]:
#Q24: Find out the number of unique job titles in 2020 (0.75 p).
df[df["Year"] == 2020]["Title"].nunique()

995

In [161]:
#Q25: Find out the number of job titles that are held by only one individual in 2020 (1 p).
(df[df["Year"] == 2020]["Title"].value_counts() == 1).sum()

175

In [163]:
#Q26: Find out the number of job titles that are held by more than 100 individuals in 2020 (0.5 p).
(df[df["Year"] == 2020]["Title"].value_counts() > 100).sum()

74

In [165]:
#Q27: How many employees do not reside in NY but have a title that includes the word 'police' (considering all case variations) (2 p)?
df[(df["State"] != "NY") & (df["Title"].str.contains("Police", case = False))]["ID"].count()

7692